app/controllers/pokemon_controller.rb

  def create
    @pokemon = Pokemon.new(pokemon_params)

    if @pokemon.save
---
INSERT INTO "pokemons" ("attack", "created_at", "defense", "image_url", "moves", "name", "poke_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def index
    @pokemon = Pokemon.all
---
SELECT "pokemons".* FROM "pokemons"

  def show
    @pokemon = Pokemon.find(params[:id])
---
SELECT  "pokemons".* FROM "pokemons"  WHERE "pokemons"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @pokemon = Pokemon.find(params[:id])
    if @pokemon.update(pokemon_params)
---
SELECT  "pokemons".* FROM "pokemons"  WHERE "pokemons"."id" = $1 LIMIT 1  [["id", 143]]
UPDATE "pokemons" SET "moves" = $1, "name" = $2, "updated_at" = $3 WHERE "pokemons"."id" = 143  [["moves", "---\n- ''\n- ''\n"], ["name", "insect"], ["updated_at", "2015-03-31 23:47:30.796354"]]